app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.all
---
SELECT `blogs`.* FROM `blogs`

    def set_blog
      @blog = Blog.find(params[:id])
---
SELECT  `blogs`.* FROM `blogs`  WHERE `blogs`.`id` = 1 LIMIT 1